infrastructure/experiments/haproxy_ab/roundrobin-2/ab_100_10.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient).....done


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2708 bytes

Concurrency Level:      10
Time taken for tests:   0.295 seconds
Complete requests:      100
Failed requests:        83
   (Connect: 0, Receive: 0, Length: 83, Exceptions: 0)
Total transferred:      288126 bytes
HTML transferred:       269926 bytes
Requests per second:    338.69 [#/sec] (mean)
Time per request:       29.526 [ms] (mean)
Time per request:       2.953 [ms] (mean, across all concurrent requests)
Transfer rate:          952.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.2      1       2
Processing:    10   25  18.4     18      99
Waiting:       10   25  18.3     18      99
Total:         10   26  18.4     19     101

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     28
  75%     31
  80%     37
  90%     49
  95%     65
  98%     89
  99%    101
 100%    101 (longest request)
